<a href="https://colab.research.google.com/github/anicelysantos/book-python-para-analise-de-dados/blob/main/carga_de_dados.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# **Lendo e escrevendo dados em formato-texto**

In [9]:
import pandas as pd
import numpy as np

In [ ]:
df = pd.read_csv('/content/drive/MyDrive/dados_pandas/pydata-book-2nd-edition/examples/ex1.csv')
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [ ]:
pd.read_table('/content/drive/MyDrive/dados_pandas/pydata-book-2nd-edition/examples/ex1.csv', sep=',')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [ ]:
#arquivos sem cabeçalho
pd.read_csv('/content/drive/MyDrive/dados_pandas/pydata-book-2nd-edition/examples/ex2.csv', header=None)

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [ ]:
#definir cabeçalho
pd.read_csv('/content/drive/MyDrive/dados_pandas/pydata-book-2nd-edition/examples/ex2.csv', names=['a','b','c','d','message'])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [ ]:
names = ['a','b','c','d','message']
pd.read_csv('/content/drive/MyDrive/dados_pandas/pydata-book-2nd-edition/examples/ex2.csv', names=names, index_col='message')

         a   b   c   d
message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

In [ ]:
parsed = pd.read_csv('/content/drive/MyDrive/dados_pandas/pydata-book-2nd-edition/examples/csv_mindex.csv', index_col=['key1','key2'])
parsed

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

In [ ]:
#arquivo sem delimitador
result = pd.read_table('/content/drive/MyDrive/dados_pandas/pydata-book-2nd-edition/examples/ex3.txt', sep='\s+')
result

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [ ]:
pd.read_csv('/content/drive/MyDrive/dados_pandas/pydata-book-2nd-edition/examples/ex4.csv', skiprows=[0,2,3])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [ ]:
result = pd.read_csv('/content/drive/MyDrive/dados_pandas/pydata-book-2nd-edition/examples/ex5.csv')
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [ ]:
pd.isnull(result)

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False   True  False    False
2      False  False  False  False  False    False

In [ ]:
result = pd.read_csv('/content/drive/MyDrive/dados_pandas/pydata-book-2nd-edition/examples/ex5.csv', na_values=['NULL'])
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [ ]:
sentinels = {'message': ['foo','NA'], 'something': ['two']}
pd.read_csv('/content/drive/MyDrive/dados_pandas/pydata-book-2nd-edition/examples/ex5.csv', na_values=sentinels)

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       NaN  5   6   NaN   8   world
2     three  9  10  11.0  12     NaN

**Lendo arquivos-texto em partes**

In [ ]:
#otimizando pra exibição ser mais compacta
pd.options.display.max_rows=10

result = pd.read_csv('/content/drive/MyDrive/dados_pandas/pydata-book-2nd-edition/examples/ex6.csv')
result

           one       two     three      four key
0     0.467976 -0.038649 -0.295344 -1.824726   L
1    -0.358893  1.404453  0.704965 -0.200638   B
2    -0.501840  0.659254 -0.421691 -0.057688   G
3     0.204886  1.074134  1.388361 -0.982404   R
4     0.354628 -0.133116  0.283763 -0.837063   Q
...        ...       ...       ...       ...  ..
9995  2.311896 -0.417070 -1.409599 -0.515821   L
9996 -0.479893 -0.650419  0.745152 -0.646038   E
9997  0.523331  0.787112  0.486066  1.093156   K
9998 -0.362559  0.598894 -1.843201  0.887292   G
9999 -0.096376 -1.012999 -0.657431 -0.573315   0

[10000 rows x 5 columns]

In [ ]:
#ler apenas uma quantidade de linhas específicas
pd.read_csv('/content/drive/MyDrive/dados_pandas/pydata-book-2nd-edition/examples/ex6.csv', nrows=5)

        one       two     three      four key
0  0.467976 -0.038649 -0.295344 -1.824726   L
1 -0.358893  1.404453  0.704965 -0.200638   B
2 -0.501840  0.659254 -0.421691 -0.057688   G
3  0.204886  1.074134  1.388361 -0.982404   R
4  0.354628 -0.133116  0.283763 -0.837063   Q

In [ ]:
#ler arquivos em partes
chunker = pd.read_csv('/content/drive/MyDrive/dados_pandas/pydata-book-2nd-edition/examples/ex6.csv', chunksize=1000)
chunker

In [ ]:
chunker = pd.read_csv('/content/drive/MyDrive/dados_pandas/pydata-book-2nd-edition/examples/ex6.csv', chunksize=1000)
tot = pd.Series([])
for piece in chunker:
  tot = tot.add(piece['key'].value_counts(), fill_value=0)
tot = tot.sort_values(ascending=False)

tot[:10]

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:2: DeprecationWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.

E    368.0
X    364.0
L    346.0
O    343.0
Q    340.0
M    338.0
J    337.0
F    335.0
K    334.0
H    330.0
dtype: float64

**Salvando dados em formato-texto**

In [ ]:
data = pd.read_csv('/content/drive/MyDrive/dados_pandas/pydata-book-2nd-edition/examples/ex5.csv')
data

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [ ]:
#salvando com separador vígula
data.to_csv('/content/drive/MyDrive/dados_pandas/out.csv')

In [ ]:
#salvando com separador barra
data.to_csv('/content/drive/MyDrive/dados_pandas/out_barra.csv', sep='|', na_rep='NULL')

In [ ]:
#Salvar sem índice e sem cabeçalho
data.to_csv('/content/drive/MyDrive/dados_pandas/out_si_sh.csv', index=False, header=False)

In [ ]:
#Salvando um outro conjunto de colunas
data.to_csv('/content/drive/MyDrive/dados_pandas/out_column.csv', index=False, columns=['a','b','c'])

In [ ]:
pd.read_csv('/content/drive/MyDrive/dados_pandas/out_column.csv')

   a   b     c
0  1   2   3.0
1  5   6   NaN
2  9  10  11.0

In [ ]:
#Salvando uma Series

dates = pd.date_range('1/1/2000', periods=7)
ts = pd.Series(np.arange(7), index=dates)
ts.to_csv('/content/drive/MyDrive/dados_pandas/tseries.csv')

**Trabalhando com formatos delimitados**

In [ ]:
import csv
f = open('/content/drive/MyDrive/dados_pandas/pydata-book-2nd-edition/examples/ex7.csv')
reader = csv.reader(f)

for line in reader:
  print(line)

['a', 'b', 'c']
['1', '2', '3']
['1', '2', '3']

In [ ]:
#lendo o arquivo em uma lista de linhas
with open('/content/drive/MyDrive/dados_pandas/pydata-book-2nd-edition/examples/ex7.csv') as f:
  lines = list(csv.reader(f))

#separando as linhas do cabeçalho
header, values = lines[0], lines[1:]

#transpondo as linhas para as colunas

data_dict = {h:v for h, v in zip(header, zip(*values))}

data_dict

{'a': ('1', '1'), 'b': ('2', '2'), 'c': ('3', '3')}

In [ ]:
#mudando o delimitador
class my_dialect(csv.Dialect):
  lineterminator = '\n'
  delimiter = ';'
  quotechar='"'
  quoting = csv.QUOTE_MINIMAL
reader = csv.reader(f, dialect=my_dialect)

In [ ]:
#mudando o delimitador de um jeito mais simples
reader = csv.reader(f, delimiter='|')

In [ ]:
#escrever arquivos com delimitadores manualmente
with open('mydata.csv', 'w') as f:
  writer = csv.writer(f, dialect=my_dialect)
  writer.writerow(('one', 'two', 'three'))
  writer.writerow(('1','2','3'))
  writer.writerow(('4','5','6'))
  writer.writerow(('7','8','9'))

# **Dados JSON**

In [1]:
import json

In [3]:
obj = """
{"name": "Wes",
"places_lived": ["United States", "Spain", "Germany"],
"pet": null,
"siblings": [{"name":"Scott", "age":30, "pets":["Zeus", "Zuko"]},
{"name":"Katie","age":38,
"pets":["Sixes","Stache","Cisco"]}]}
"""

In [6]:
result = json.loads(obj)
result

{'name': 'Wes',
 'pet': None,
 'places_lived': ['United States', 'Spain', 'Germany'],
 'siblings': [{'age': 30, 'name': 'Scott', 'pets': ['Zeus', 'Zuko']},
  {'age': 38, 'name': 'Katie', 'pets': ['Sixes', 'Stache', 'Cisco']}]}

In [7]:
#converte um objeto python em Json
asjson = json.dumps(result)

In [10]:
#json para dataframe a partir de uma coluna especifica do dicionario
siblings = pd.DataFrame(result['siblings'], columns = ['name','age'])
siblings

    name  age
0  Scott   30
1  Katie   38

In [11]:
#converte json para dataframe automaticamente
data = pd.read_json('/content/drive/MyDrive/dados_pandas/pydata-book-2nd-edition/examples/example.json')
data

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [12]:
#exportar dados do pandas pra um JSON
print(data.to_json())

{"a":{"0":1,"1":4,"2":7},"b":{"0":2,"1":5,"2":8},"c":{"0":3,"1":6,"2":9}}

In [13]:
print(data.to_json(orient='records'))

[{"a":1,"b":2,"c":3},{"a":4,"b":5,"c":6},{"a":7,"b":8,"c":9}]

# **XML e HTML: web scraping**

In [14]:
!pip install beautifulsoup4 html5lib

Requirement already satisfied: beautifulsoup4 in /usr/local/lib/python3.7/dist-packages (4.6.3)
Requirement already satisfied: html5lib in /usr/local/lib/python3.7/dist-packages (1.0.1)
Requirement already satisfied: six>=1.9 in /usr/local/lib/python3.7/dist-packages (from html5lib) (1.15.0)
Requirement already satisfied: webencodings in /usr/local/lib/python3.7/dist-packages (from html5lib) (0.5.1)

In [15]:
!pip install lxml

Requirement already satisfied: lxml in /usr/local/lib/python3.7/dist-packages (4.2.6)

In [16]:
tables = pd.read_html('/content/drive/MyDrive/dados_pandas/pydata-book-2nd-edition/examples/fdic_failed_bank_list.html')

In [17]:
len(tables)

1

In [18]:
failures = tables[0]

In [20]:
failures.head()

                      Bank Name  ...       Updated Date
0                   Allied Bank  ...  November 17, 2016
1  The Woodbury Banking Company  ...  November 17, 2016
2        First CornerStone Bank  ...  September 6, 2016
3            Trust Company Bank  ...  September 6, 2016
4    North Milwaukee State Bank  ...      June 16, 2016

[5 rows x 7 columns]

In [21]:
#Mudar o formato de data de string para data e colocar dentro de um dataframe
close_timestamps = pd.to_datetime(failures['Closing Date'])

In [22]:
#Contar quantos bancos faliram por ano
close_timestamps.dt.year.value_counts()

2010    157
2009    140
2011     92
2012     51
2008     25
2013     24
2014     18
2002     11
2015      8
2016      5
2004      4
2001      4
2007      3
2003      3
2000      2
Name: Closing Date, dtype: int64

**Fazendo parse de XML com lxml.objectify**

In [23]:
from lxml import objectify

In [24]:
path = '/content/drive/MyDrive/dados_pandas/pydata-book-2nd-edition/datasets/mta_perf/Performance_MNR.xml'
parsed = objectify.parse(open(path))
root = parsed.getroot()

In [28]:
data = []
skip_fields = ['PARENT_SEQ','INDICATOR_SEQ','DESIRED_CHANGE', 'DECIMAL_PLACES']

for elt in root.INDICATOR:
  el_data = {}
  for child in elt.getchildren():
    if child.tag in skip_fields:
      continue
    el_data[child.tag] = child.pyval
    data.append(el_data)

In [ ]:
perf = pd.DataFrame(data)
perf.head()

In [30]:
from io import StringIO

In [31]:
tag = '<a href="http://wwww.google.com">Google</a>'
root = objectify.parse(StringIO(tag)).getroot()

In [32]:
root

In [33]:
root.get('href')

'http://wwww.google.com'

In [34]:
root.text

'Google'

# **Formatos de dados binários**

In [36]:
frame = pd.read_csv('/content/drive/MyDrive/dados_pandas/pydata-book-2nd-edition/examples/ex1.csv')
frame

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [38]:
frame.to_pickle('/content/drive/MyDrive/dados_pandas/frame_pickle')

In [39]:
pd.read_pickle('/content/drive/MyDrive/dados_pandas/frame_pickle')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

# **Usando o formato HDF5**

In [40]:
frame = pd.DataFrame({'a':np.random.randn(100)})

In [41]:
store = pd.HDFStore('mydata.h5')

In [42]:
store['obj1'] = frame

In [43]:
store['obj1_col'] = frame['a']

In [44]:
store

<class 'pandas.io.pytables.HDFStore'>
File path: mydata.h5

In [46]:
store['obj1']

           a
0  -0.695694
1   0.514278
2  -0.216923
3  -0.158399
4   0.933002
..       ...
95  1.467235
96 -1.137128
97 -1.227166
98 -0.007332
99  0.644578

[100 rows x 1 columns]

In [48]:
store.put('obj2', frame, format='table')

In [49]:
store.select('obj2', where=['index >= 10 and index <= 15'])

           a
10 -2.512878
11 -0.131403
12  1.351557
13 -2.106987
14  0.253309
15  0.117143

In [50]:
store.close()

In [51]:

frame.to_hdf('mydata.h5', 'obj3', format='table')

In [53]:
pd.read_hdf('mydata.h5', 'obj3',where = ['index < 5'])

          a
0 -0.695694
1  0.514278
2 -0.216923
3 -0.158399
4  0.933002

# **Lendo arquivos do Microsoft Excel**